
Напишите программу, где пользователь должен ввести строку из слов, разделенных пробелами. 
Например: “I love java 8 Я люблю java 14 core1”. Выполните следующие действия:
1. Выведите слова, состоящие только из латиницы.
2. Выведите количество этих слов.

Ответ:


package com.max.idea;

import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Main {
        public static void main(String[] args) {

                Scanner scanner = new Scanner(System.in);
                System.out.println("Введите строку из слов, разделенных пробелами: ");
                String input = scanner.nextLine();

                Pattern latinPattern = Pattern.compile("\\b[A-Za-z]+\\b");

                int Count = 0;
                Matcher matcher = latinPattern.matcher(input);

                while (matcher.find()) {
                System.out.println(matcher.group());
                Count++;
                }
                System.out.println("Количество слов, состоящих только из латиницы: " + Count);
        }
}