Задача №8_Циклы

Напишите программу, где пользователь вводит любое целое положительное число n. А программа суммирует все нечетные числа от 1 до введенного пользователем числа n.
Ответ:

package com.max.idea;

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        Scanner scan = new Scanner(System.in);
        System.out.print("Введите любое целое положительное число n: ");
        int n = scan.nextInt();
        int sum = 0;

        for (int i = 1; i < n; i++) { // Введенное пользователем число не учитывается при суммировании
           if (! (i%2 ==0)) {
               sum += i;
             }
        }
        System.out.println(sum);
    }
}