Задача №9_Циклы

Напишите программу:

1. Пользователь вводит размер массива и данные с клавиатуры в массив типа double.
2. Посчитайте среднее арифметическое элементов массива.
3. После этого произведите вывод массива на экран, где каждый элемент массива умножается на среднее арифметическое

Ответ:

    package com.max.idea;

    import java.util.Scanner;

    public class Main {
        public static void main(String[] args) {

            double sum = 0;

            Scanner scan = new Scanner(System.in);
            System.out.print("Введите длину массива: ");
            int size = scan.nextInt();
            double[] nums = new double[size];
            System.out.println("Введите числа в массив: ");
            for (int i = 0; i < size; i++) {
                nums[i] = scan.nextDouble(); // Заполняем массив элементами
            }
            for (double i:nums) {
                    sum += i;
            }
            System.out.println("Среднее арифметическое чисел = " + sum/nums.length);
            for (int i = 0; i < nums.length; i++) {
            System.out.println(nums[i] * (sum / nums.length));
         }
       }
     }

___
