Напишите программу конвертер валют. Программа должна переводить рубли в доллары по текущему курсу. Пользователь вводит текущий курс и количество рублей. Итоговое значение должно быть округлено до двух знаков после запятой.

Пример для теста работы программы:

- Курс доллара: 67,55
- Количество рублей: 1000
- Итого: 14,80 долларов

Ответ:

package com.max.idea;

import java.text.DecimalFormat;
import java.util.Scanner;

public class Main {


    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите Курс доллара: ");
        double dollarCourse = scanner.nextDouble();
        System.out.print("Введите Количество рублей: ");
        double rubCount = scanner.nextDouble();
        DecimalFormat format = new DecimalFormat("#0.00");
        System.out.println("Итого: " + format.format(rubCount/dollarCourse) + " долларов.");
    }
}